# Install command-line tools with Homebrew
# Usage: `brew bundle` - automatically looks at Brewfile

tap "homebrew/cask"

# set arguments for all 'brew cask install' commands
cask_args appdir: "~/Applications"

# Core utilities

brew "coreutils"
brew "moreutils"
brew "findutils"
brew "htop"
brew "tmux"
brew "wget"
brew "ack"
brew "tldr"
brew "wdiff"


# Install Newest Bash
brew "bash"
brew "bash-completion"

# Programming language related installations
brew "go"
brew "pyenv"
brew "cmake"
brew "clang-format"

# Git utilities
brew "git"
brew "tig"

# Other Useful binaries
brew "the_silver_searcher"
brew "imagemagick"
brew "ncdu" # ncdu- ncurses disk usage- for sorting directories

# Cask installation
cask "google-chrome"
cask "iterm2"
cask "postman"




