# Install command-line tools with Homebrew
# Usage: `brew bundle` - automatically looks at Brewfile

tap "homebrew/cask"
tap "homebrew/bundle"

# set arguments for all 'brew cask install' commands
cask_args appdir: "~/Applications"

# Core utilities

brew "coreutils" # update (Mac defaults are out of date)
brew "moreutils"
brew "findutils"
brew "htop"
brew "tmux"
brew "grep"
brew "vim"
brew "wget"
brew "ack"
brew "tldr"
brew "bat" # better cat :) (color + less)
brew "mosh"

# Install Newest Bash
brew "bash"
brew "bash-completion"

# Programming language related installations
brew "pyenv"
brew "cmake"
brew "clang-format"
#brew "npm"
#brew "yarn"
#brew "go"

# Git utilities
#brew "git"
brew "tig"

# Other Useful binaries
brew "the_silver_searcher"
brew "imagemagick"
brew "ncdu" # ncdu- ncurses disk usage- for sorting directories
brew "st" # command line simple stats
brew "tree" # directory navigation
brew "wdiff"
brew "broot" # like tree but fancier
brew "gnuplot" # command line plotting / graphing library
brew "reattach-to-user-namespace"
brew "fzf"
brew "zsh-autosuggestions"
brew "shellcheck" # useful in vim syntastic and as stand-alone

# Cask installation
#cask "iterm2"
cask "visual-studio-code"
#cask "google-chrome"
#cask "firefox"
#cask "virtualbox" # might require permissions in security settings
#cask "postman"
#cask "slack"
cask "whatsapp"


